Repository: BruceXcluding/ToolUniverse
Catalog: docs/locale/*/LC_MESSAGES/api/tooluniverse.tools.HPA_get_comprehensive_gene_details_by_ensembl_*.po
Languages: id

source: tooluniverse.tools.HPA\_get\_comprehensive\_gene\_details\_by\_ensembl\_id module
id: tooluniverse.tools.HPA\_get\_comprehensive\_gene\_details\_by\_ensembl\_id 模块

source: Get detailed in-depth information from gene page using Ensembl Gene ID, including image URLs, ant...
id: 通过使用Ensembl基因ID从基因页面获取详细的深入信息，包括图像URL、注释等。

source: Parameters
id: 参数

source: Ensembl Gene ID, e.g., 'ENSG00000064787' (BCAS1), 'ENSG00000141510' (TP53), e...
id: Ensembl基因ID，例如：'ENSG00000064787'（BCAS1）、'ENSG00000141510'（TP53）、e...

source: Whether to include image URL information (immunofluorescence, cell line image...
id: 是否包含图像URL信息（免疫荧光、细胞系图像...

source: Whether to include detailed antibody information (validation status, Western ...
id: 是否包含详细的抗体信息（验证状态、西方...

source: Whether to include detailed expression data (tissue specificity, subcellular ...
id: 是否包含详细的表达数据（组织特异性、亚细胞定位等）...

source: Callback for streaming output
id: 用于流式输出的回调

source: Enable caching
id: 启用缓存

source: Validate parameters
id: 验证参数

source: Return type
id: 返回类型
